In [1]:
#Importing Dependencies
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans
from sklearn import neighbors
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

In [100]:
#ETL FOR ALTERNATIVE DATA SOURCE, IGNORE THIS ONE!
# books_df= pd.read_csv("books.csv", on_bad_lines='skip')
# books_df.head()

In [102]:
#ETL FOR BX-Books, change position A1 to 'ISBN' in the CSV in Excel!
#I had to change the encoding because the CSV would not read in with UTF-08.
BX_1= pd.read_csv("/Users/juliencounts/Desktop/BX-CSV-Dump/BX-Books.csv", on_bad_lines='skip', encoding='latin-1' )
BX_1.head()

/var/folders/xn/zxr8x63d7dl9t22nbdnj_b2c0000gn/T/ipykernel_59150/2945289463.py:2: DtypeWarning: Columns (9,10,11,12,13,14,15,16,17,18,19,20,21) have mixed types. Specify dtype option on import or set low_memory=False.
  BX_1= pd.read_csv("/Users/juliencounts/Desktop/BX-CSV-Dump/BX-Books.csv", on_bad_lines='skip', encoding='latin-1' )

,ISBN,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
0,"0195153448;""Classical Mythology"";""Mark P. O. M...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"0002005018;""Clara Callan"";""Richard Bruce Wrigh...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"0060973129;""Decision in Normandy"";""Carlo D'Est...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"0374157065;""Flu: The Story of the Great Influe...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"0393045218;""The Mummies of Urumchi"";""E. J. W. ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [65]:
#Splitting the ISBN column based on the semi-colon
BX_1_split= BX_1['ISBN'].str.split(';')
BX_1_split.head()

0    [0195153448, "Classical Mythology", "Mark P. O...
1    [0002005018, "Clara Callan", "Richard Bruce Wr...
2    [0060973129, "Decision in Normandy", "Carlo D'...
3    [0374157065, "Flu: The Story of the Great Infl...
4    [0393045218, "The Mummies of Urumchi", "E. J. ...
Name: ISBN, dtype: object

In [66]:
#Turning this split into a dataframe
BX_1_df= pd.DataFrame(BX_1_split.tolist()).add_prefix('Book_')
BX_1_df.head()

,Book_0,Book_1,Book_2,Book_3,Book_4,Book_5,Book_6,Book_7,Book_8,Book_9,Book_10,Book_11,Book_12,Book_13
0,0195153448,"""Classical Mythology""","""Mark P. O. Morford""","""2002""","""Oxford University Press""","""http://images.amazon.com/images/P/0195153448....","""http://images.amazon.com/images/P/0195153448....","""http://images.amazon.com/images/P/0195153448....",None,None,None,None,None,None
1,0002005018,"""Clara Callan""","""Richard Bruce Wright""","""2001""","""HarperFlamingo Canada""","""http://images.amazon.com/images/P/0002005018....","""http://images.amazon.com/images/P/0002005018....","""http://images.amazon.com/images/P/0002005018....",None,None,None,None,None,None
2,0060973129,"""Decision in Normandy""","""Carlo D'Este""","""1991""","""HarperPerennial""","""http://images.amazon.com/images/P/0060973129....","""http://images.amazon.com/images/P/0060973129....","""http://images.amazon.com/images/P/0060973129....",None,None,None,None,None,None
3,0374157065,"""Flu: The Story of the Great Influenza Pandemi...","""Gina Bari Kolata""","""1999""","""Farrar Straus Giroux""","""http://images.amazon.com/images/P/0374157065....","""http://images.amazon.com/images/P/0374157065....","""http://images.amazon.com/images/P/0374157065....",None,None,None,None,None,None
4,0393045218,"""The Mummies of Urumchi""","""E. J. W. Barber""","""1999""","""W. W. Norton &amp","Company""","""http://images.amazon.com/images/P/0393045218....","""http://images.amazon.com/images/P/0393045218....","""http://images.amazon.com/images/P/0393045218....",None,None,None,None,None

In [68]:
#Removing the unnecessary columns
BX_1_drop= BX_1_df.drop(columns=['Book_5','Book_6', 'Book_7','Book_8','Book_9', 
                                      'Book_10', 'Book_11', 'Book_12', 'Book_13'])
BX_1_drop.head()

,Book_0,Book_1,Book_2,Book_3,Book_4
0,0195153448,"""Classical Mythology""","""Mark P. O. Morford""","""2002""","""Oxford University Press"""
1,0002005018,"""Clara Callan""","""Richard Bruce Wright""","""2001""","""HarperFlamingo Canada"""
2,0060973129,"""Decision in Normandy""","""Carlo D'Este""","""1991""","""HarperPerennial"""
3,0374157065,"""Flu: The Story of the Great Influenza Pandemi...","""Gina Bari Kolata""","""1999""","""Farrar Straus Giroux"""
4,0393045218,"""The Mummies of Urumchi""","""E. J. W. Barber""","""1999""","""W. W. Norton &amp"

In [69]:
#Renaming the columns. This is the final step for BX-Books.csv
BX_1 = BX_1_drop.rename(columns={'Book_0': 'ISBN', 'Book_1': 'Title', 'Book_2': 'Author', 
                                        'Book_3': 'Year', 'Book_4': 'Publisher'})
BX_1.head()

,ISBN,Title,Author,Year,Publisher
0,0195153448,"""Classical Mythology""","""Mark P. O. Morford""","""2002""","""Oxford University Press"""
1,0002005018,"""Clara Callan""","""Richard Bruce Wright""","""2001""","""HarperFlamingo Canada"""
2,0060973129,"""Decision in Normandy""","""Carlo D'Este""","""1991""","""HarperPerennial"""
3,0374157065,"""Flu: The Story of the Great Influenza Pandemi...","""Gina Bari Kolata""","""1999""","""Farrar Straus Giroux"""
4,0393045218,"""The Mummies of Urumchi""","""E. J. W. Barber""","""1999""","""W. W. Norton &amp"

In [74]:
#Reading in the BX-Books-Ratings.csv. Change position A1 to Book-Rating in Excel to make this easy!
BX_ratings= pd.read_csv("/Users/juliencounts/Desktop/BX-CSV-Dump/BX-Book-Ratings.csv",
                        on_bad_lines='skip', encoding='latin-1')
BX_ratings.head()

/var/folders/xn/zxr8x63d7dl9t22nbdnj_b2c0000gn/T/ipykernel_59150/3088893860.py:1: DtypeWarning: Columns (1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  BX_ratings= pd.read_csv("/Users/juliencounts/Desktop/BX-CSV-Dump/BX-Book-Ratings.csv",

               Book-Rating Unnamed: 1 Unnamed: 2
0  276725;"034545104X";"0"        NaN        NaN
1  276726;"0155061224";"5"        NaN        NaN
2  276727;"0446520802";"0"        NaN        NaN
3  276729;"052165615X";"3"        NaN        NaN
4  276729;"0521795028";"6"        NaN        NaN

In [76]:
#Splitting the Book-Rating column based on the semi-colon
BX_ratings_split= BX_ratings['Book-Rating'].str.split(';')
BX_ratings_split.head()

0    [276725, "034545104X", "0"]
1    [276726, "0155061224", "5"]
2    [276727, "0446520802", "0"]
3    [276729, "052165615X", "3"]
4    [276729, "0521795028", "6"]
Name: Book-Rating, dtype: object

In [78]:
#Pushing the split to a dataframe
BX_ratings_df= pd.DataFrame(BX_ratings_split.tolist()).add_prefix('Col_')
BX_ratings_df.head()

    Col_0         Col_1 Col_2
0  276725  "034545104X"   "0"
1  276726  "0155061224"   "5"
2  276727  "0446520802"   "0"
3  276729  "052165615X"   "3"
4  276729  "0521795028"   "6"

In [84]:
#Renaming the columns
BX_ratings= BX_ratings_df.rename(columns={'Col_0': 'User_ID', 'Col_1': 'ISBN_1', 'Col_2': 'Rating'})
BX_ratings.head()

  User_ID        ISBN_1 Rating
0  276725  "034545104X"    "0"
1  276726  "0155061224"    "5"
2  276727  "0446520802"    "0"
3  276729  "052165615X"    "3"
4  276729  "0521795028"    "6"

In [95]:
#Dropping the apostrophes around ISBN_1 so it will join with the first CSV 
BX_ratings['ISBN_1']= BX_ratings['ISBN_1'].str.replace(r'"', '')
BX_ratings.head()

  User_ID      ISBN_1 Rating
0  276725  034545104X    "0"
1  276726  0155061224    "5"
2  276727  0446520802    "0"
3  276729  052165615X    "3"
4  276729  0521795028    "6"

In [99]:
#Joining the ratings csv with the books csv based on matching their ISBNs.
BX_complete= pd.merge(BX_ratings, BX_1, left_on="ISBN_1", right_on="ISBN", how="inner")
BX_complete.head(20)

,User_ID,ISBN_1,Rating,ISBN,Title,Author,Year,Publisher
0,276725,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
1,2313,034545104X,"""5""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
2,6543,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
3,8680,034545104X,"""5""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
4,10314,034545104X,"""9""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
5,23768,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
6,28266,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
7,28523,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
8,39002,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
9,50403,034545104X,"""9""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
10,56157,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
11,59102,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
12,59287,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
13,63970,034545104X,"""8""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
14,77480,034545104X,"""8""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
15,77940,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
16,81977,034545104X,"""0""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
17,94362,034545104X,"""5""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
18,98391,034545104X,"""9""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""
19,112199,034545104X,"""6""",034545104X,"""Flesh Tones: A Novel""","""M. J. Rose""","""2002""","""Ballantine Books"""

In [104]:
#Getting an overview of the data
BX_complete.describe()

,User_ID,ISBN_1,Rating,ISBN,Title,Author,Year,Publisher
count,940674,940674,940674,940674,940674,837879,834349,834178
unique,83600,257824,11,257824,227363,90817,3654,14624
top,11676,0971880107,"""0""",0971880107,"""Wild Animus""","""Stephen King""","""2002""","""Ballantine Books"""
freq,11144,2262,589028,2262,2262,8135,74594,29552